#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ngsh/playground/runs/run-rTukQDVqHUj46DEB

Waiting for the plan to start...

Terraform v1.6.4
on linux_amd64
Initializing plugins and modules...
tls_private_key.this: Refreshing state... [id=0698ddf128b32ca0d55f079026519b449bbdbea5]
aws_iam_user.this: Refreshing state... [id=reviewer]
data.aws_ami.this: Refreshing...
data.aws_caller_identity.current: Refreshing...
module.ec2-instance.data.aws_partition.current: Refreshing...
aws_vpc.main: Refreshing state... [id=vpc-0747afa6e1fccfbaf]
module.ec2-instance.data.aws_partition.current: Refresh complete after 0s [id=aws]
aws_iam_user_policy_attachment.this: Refreshing state... [id=reviewer-20231116140838272800000001]
aws_iam_user_login_profile.this: Refreshing state... [id=reviewer]
data.aws_caller_identity.current: Refresh complete after 0s [id=550540351038]
data.aws_ami.this: Refresh complete after 1s [id=ami-0611e918e485082ce]
aws_internet_gateway.main: Refreshing state... [id=igw-0384ac8917cb2833a]
aws_subnet.main: Refreshing state... [id=subnet-012dbeccf1a1d8aa8]
aws_security_group.main: Refreshing state... [id=sg-08b79d78f5e6d6b3a]
aws_route_table.main: Refreshing state... [id=rtb-09cab620365cb10c2]
module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-0e0f8c6a5ee4877ba]
aws_route_table_association.this: Refreshing state... [id=rtbassoc-0c32d1d84969b4b7b]
aws_iam_user.this: Drift detected (update)
aws_iam_user_login_profile.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Allow EC2 instance connect"
      + id          = (known after apply)
      + name        = "allow-instance-connect"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2-instance-connect:SendSSHPublicKey",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ec2:osuser" = "ec2-user"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:550540351038:instance/i-0e0f8c6a5ee4877ba",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_user_policy_attachment.additional will be created
  + resource "aws_iam_user_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "reviewer"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ngsh, Action: `pull_request`*